In [8]:
import sqlite3
import pandas as pd

In [3]:
path = 'C:\\Users\\sophia.yue\\Infosys\Data\\'
conn = sqlite3.connect(path + 'chinook.db')

In [6]:
def cr_df_sql(tbl_nam, cond = ''):
    sql = f'select * from {tbl_nam} {cond}'
    df_rt = pd.readsql_query(sql, conn)
    return df_rt

exec_sql = lambda title, sql_cmd: print(f'{title} \n {pd.read_sql_query(sql_cmd, conn)}') 

def tbl_attr(tbl_nam):
    tbl_attr = f'PRAGMA table_info({tbl_nam})'
    exec_sql (f"Attritube of {tbl_nam}", tbl_attr)

In [9]:
tbl_attr('employees')

Attritube of employees
     cid        name          type  notnull dflt_value  pk
0     0  EmployeeId       INTEGER        1       None   1
1     1    LastName  NVARCHAR(20)        1       None   0
2     2   FirstName  NVARCHAR(20)        1       None   0
3     3       Title  NVARCHAR(30)        0       None   0
4     4   ReportsTo       INTEGER        0       None   0
5     5   BirthDate      DATETIME        0       None   0
6     6    HireDate      DATETIME        0       None   0
7     7     Address  NVARCHAR(70)        0       None   0
8     8        City  NVARCHAR(40)        0       None   0
9     9       State  NVARCHAR(40)        0       None   0
10   10     Country  NVARCHAR(40)        0       None   0
11   11  PostalCode  NVARCHAR(10)        0       None   0
12   12       Phone  NVARCHAR(24)        0       None   0
13   13         Fax  NVARCHAR(24)        0       None   0
14   14       Email  NVARCHAR(60)        0       None   0

In [14]:
sql = """select * from employees limit 10
"""
exec_sql (f"employees top 10", sql)

employees top 10
    EmployeeId  LastName FirstName                Title  ReportsTo  \
0           1     Adams    Andrew      General Manager        NaN
1           2   Edwards     Nancy        Sales Manager        1.0
2           3   Peacock      Jane  Sales Support Agent        2.0
3           4      Park  Margaret  Sales Support Agent        2.0
4           5   Johnson     Steve  Sales Support Agent        2.0
5           6  Mitchell   Michael           IT Manager        1.0
6           7      King    Robert             IT Staff        6.0
7           8  Callahan     Laura             IT Staff        6.0

             BirthDate             HireDate                      Address  \
0  1962-02-18 00:00:00  2002-08-14 00:00:00          11120 Jasper Ave NW
1  1958-12-08 00:00:00  2002-05-01 00:00:00                 825 8 Ave SW
2  1973-08-29 00:00:00  2002-04-01 00:00:00                1111 6 Ave SW
3  1947-09-19 00:00:00  2003-05-03 00:00:00             683 10 Street SW
4  1965-03-03 00:00:00  2003-10-17 00:00:00                 7727B 41 Ave
5  1973-07-01 00:00:00  2003-10-17 00:00:00         5827 Bowness Road NW
6  1970-05-29 00:00:00  2004-01-02 00:00:00  590 Columbia Boulevard West
7  1968-01-09 00:00:00  2004-03-04 00:00:00                  923 7 ST NW

         City State Country PostalCode              Phone                Fax  \
0    Edmonton    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
1     Calgary    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2     Calgary    AB  Canada    T2P 5M5  +1 (403) 262-3443  +1 (403) 262-6712
3     Calgary    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
4     Calgary    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543
5     Calgary    AB  Canada    T3B 0C5  +1 (403) 246-9887  +1 (403) 246-9899
6  Lethbridge    AB  Canada    T1K 5N8  +1 (403) 456-9986  +1 (403) 456-8485
7  Lethbridge    AB  Canada    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772

                      Email
0    andrew@chinookcorp.com
1     nancy@chinookcorp.com
2      jane@chinookcorp.com
3  margaret@chinookcorp.com
4     steve@chinookcorp.com
5   michael@chinookcorp.com
6    robert@chinookcorp.com
7     laura@chinookcorp.com

In [15]:
sql = """select EmployeeId, BirthDate   from employees  order by BirthDate desc  limit 10
"""
exec_sql (f"employees top 10", sql)

employees top 10
    EmployeeId            BirthDate
0           3  1973-08-29 00:00:00
1           6  1973-07-01 00:00:00
2           7  1970-05-29 00:00:00
3           8  1968-01-09 00:00:00
4           5  1965-03-03 00:00:00
5           1  1962-02-18 00:00:00
6           2  1958-12-08 00:00:00
7           4  1947-09-19 00:00:00

In [12]:
sql = """SELECT m.firstname || ' ' || m.lastname AS 'Manager',
       e.firstname || ' ' || e.lastname AS 'Direct report' 
FROM employees e
INNER JOIN employees m ON m.employeeid = e.reportsto
ORDER BY manager"""
exec_sql (f"Self join employees", sql)

Self join employees
             Manager     Direct report
0      Andrew Adams     Nancy Edwards
1      Andrew Adams  Michael Mitchell
2  Michael Mitchell       Robert King
3  Michael Mitchell    Laura Callahan
4     Nancy Edwards      Jane Peacock
5     Nancy Edwards     Margaret Park
6     Nancy Edwards     Steve Johnson

In [25]:
simp_data = (("James", "Sales", 3000), \
    ("Michael", "Sales", 4600),  \
    ("Robert", "Sales", 4100),   \
    ("Maria", "Finance", 3000),  \
    ("James", "Sales", 3000),    \
    ("Scott", "Finance", 3300),  \
    ("Jen", "Finance", 3900),    \
    ("Jeff", "Marketing", 3000), \
    ("Kumar", "Marketing", 2000),\
    ("Saif", "Sales", 4100) \
  )
 
columns= ["employee_name", "department", "salary"]
my_data = pd.DataFrame(data = simp_data, columns = columns)
my_data = my_data.reset_index(drop = True)
my_data

  employee_name department  salary
0         James      Sales    3000
1       Michael      Sales    4600
2        Robert      Sales    4100
3         Maria    Finance    3000
4         James      Sales    3000
5         Scott    Finance    3300
6           Jen    Finance    3900
7          Jeff  Marketing    3000
8         Kumar  Marketing    2000
9          Saif      Sales    4100

In [20]:
my_data

  employee_name department  salary
0         James      Sales    3000
1       Michael      Sales    4600
2        Robert      Sales    4100
3         Maria    Finance    3000
4         James      Sales    3000
5         Scott    Finance    3300
6           Jen    Finance    3900
7          Jeff  Marketing    3000
8         Kumar  Marketing    2000
9          Saif      Sales    4100

In [28]:
my_data.to_sql("my_data", conn, if_exists="replace", index = False)

In [32]:
sql = """select * from my_data order by salary desc
"""
exec_sql (f"employees top 10", sql)

employees top 10
   employee_name department  salary
0       Michael      Sales    4600
1        Robert      Sales    4100
2          Saif      Sales    4100
3           Jen    Finance    3900
4         Scott    Finance    3300
5         James      Sales    3000
6         Maria    Finance    3000
7         James      Sales    3000
8          Jeff  Marketing    3000
9         Kumar  Marketing    2000

In [ ]:
SELECT
	Val,
	DENSE_RANK () OVER ( 
		ORDER BY Val ) 
	ValRank 
FROM
	DenseRankDemo;

In [33]:
sql = """
select *, dense_rank() over (order by salary desc) salary_rank from my_data
"""
exec_sql (f"dense_rank", sql)

dense_rank
   employee_name department  salary  salary_rank
0       Michael      Sales    4600            1
1        Robert      Sales    4100            2
2          Saif      Sales    4100            2
3           Jen    Finance    3900            3
4         Scott    Finance    3300            4
5         James      Sales    3000            5
6         Maria    Finance    3000            5
7         James      Sales    3000            5
8          Jeff  Marketing    3000            5
9         Kumar  Marketing    2000            6

In [34]:
sql = """
select *, rank() over (order by salary desc) salary_rank from my_data
"""
exec_sql (f"rank", sql)

rank
   employee_name department  salary  salary_rank
0       Michael      Sales    4600            1
1        Robert      Sales    4100            2
2          Saif      Sales    4100            2
3           Jen    Finance    3900            4
4         Scott    Finance    3300            5
5         James      Sales    3000            6
6         Maria    Finance    3000            6
7         James      Sales    3000            6
8          Jeff  Marketing    3000            6
9         Kumar  Marketing    2000           10

In [36]:
sql= """
select * from 
(select *, row_number() over (partition  by department order by salary desc) as seqnum
          from my_data) tmp
where seqnum = 1 
"""
exec_sql (f"department top salary", sql)

department top salary
   employee_name department  salary  seqnum
0           Jen    Finance    3900       1
1          Jeff  Marketing    3000       1
2       Michael      Sales    4600       1